package ch04;

import java.util.Scanner;

public class FlowEx29 {

	public static void main(String[] args) {
	
		for (int i = 1; i <= 100; i++) {
			System.out.printf("i=%d", i);
			// i=1i=2i=3i=4i=5i=6i=7i=8i=9i=10i=11i=12i=13i=14i=15i=16i=17i=18i=19i=20i=21i=22i=23i=24i=25i=26i=27i=28i=29i=30i=31i=32i=33i=34i=35i=36i=37i=38i=39i=40i=41i=42i=43i=44i=45i=46i=47i=48i=49i=50i=51i=52i=53i=54i=55i=56i=57i=58i=59i=60i=61i=62i=63i=64i=65i=66i=67i=68i=69i=70i=71i=72i=73i=74i=75i=76i=77i=78i=79i=80i=81i=82i=83i=84i=85i=86i=87i=88i=89i=90i=91i=92i=93i=94i=95i=96i=97i=98i=99i=100
			int tmp = i;
			do {
				if (tmp % 10 % 3 == 0 && tmp % 10 != 0) {
					System.out.print("짝");
				}
			} while ((tmp /= 10) != 0);
			System.out.println();
		}
	}
//			i=1
//			i=2
//			i=3짝
//			i=4
//			i=5
//			i=6짝
//			i=7
//			i=8
//			i=9짝
//			i=10
//			i=11
//			i=12
//			i=13짝
//			i=14
//			i=15
//			i=16짝
//			i=17
//			i=18
//			i=19짝
//			i=20
//			i=21
//			i=22
//			i=23짝
//			i=24
//			i=25
//			i=26짝
//			i=27
//			i=28
//			i=29짝
//			i=30짝
//			i=31짝
//			i=32짝
//			i=33짝짝
//			i=34짝
//			i=35짝
//			i=36짝짝
//			i=37짝
//			i=38짝
//			i=39짝짝
//			i=40
//			i=41
//			i=42
//			i=43짝
//			i=44
//			i=45
//			i=46짝
//			i=47
//			i=48
//			i=49짝
//			i=50
//			i=51
//			i=52
//			i=53짝
//			i=54
//			i=55
//			i=56짝
//			i=57
//			i=58
//			i=59짝
//			i=60짝
//			i=61짝
//			i=62짝
//			i=63짝짝
//			i=64짝
//			i=65짝
//			i=66짝짝
//			i=67짝
//			i=68짝
//			i=69짝짝
//			i=70
//			i=71
//			i=72
//			i=73짝
//			i=74
//			i=75
//			i=76짝
//			i=77
//			i=78
//			i=79짝
//			i=80
//			i=81
//			i=82
//			i=83짝
//			i=84
//			i=85
//			i=86짝
//			i=87
//			i=88
//			i=89짝
//			i=90짝
//			i=91짝
//			i=92짝
//			i=93짝짝
//			i=94짝
//			i=95짝
//			i=96짝짝
//			i=97짝
//			i=98짝
//			i=99짝짝
//			i=100

}
